app/services/shipments/creator.rb

SELECT "carriers".* FROM "carriers" WHERE "carriers"."name" = $1 LIMIT $2  [["name", "FEDEX"], ["LIMIT", 1]]
---
    def set_carrier
      @carrier = Carrier.find_by!(name: @carrier_name)

INSERT INTO "shipments" ("account_id", "status", "tracking_number", "created_at", "updated_at", "tracking_history", "carrier_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create_shipment
      Shipment.create(
        shipment_params
      )