app/services/carriers/tracking_requester_dhl.rb

    def find_parsed_rule(code)
      ParserRule.find_or_create_by(carrier: carrier, code: code)
---
SELECT "parser_rules".* FROM "parser_rules" WHERE "parser_rules"."carrier_id" = $1 AND "parser_rules"."code" = $2 LIMIT $3  [["carrier_id", 4], ["code", "delivered"], ["LIMIT", 1]]

    def carrier
      @carrier ||= Carrier.find_by(name: @carrier_name)
---
SELECT "carriers".* FROM "carriers" WHERE "carriers"."name" = $1 LIMIT $2  [["name", "DHL"], ["LIMIT", 1]]