app/models/shipment.rb

UPDATE "shipments" SET "status" = $1, "updated_at" = $2, "tracking_history" = $3, "destination" = $4 WHERE "shipments"."id" = $5
---
  def tracking_shipment
    carrier_name = self.carrier.name
    new_data = "Carriers::TrackingRequester#{carrier_name.capitalize}".constantize.new(tracking_number: self.tracking_number, carrier_name: carrier_name).call
    self.update(status: new_data[:status], tracking_history: new_data[:tracking_history], destination: new_data[:destination])