app/models/user.rb

INSERT INTO "accounts" ("company_name", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["company_name", "Bridgecoders"], ["active", true], ["created_at", "2023-08-10 00:52:58.888087"], ["updated_at", "2023-08-10 00:52:58.888087"]]
---
  def onboard_account
    # We create a new account and assign it to the user
    account = Account.create!(company_name: 'Bridgecoders')